In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={"elma":30, "artmut":45, "mandalina":20}
pd.Series(dict1)

elma         30
artmut       45
mandalina    20
dtype: int64

In [4]:
listfiyat=[30,45,20]
listisim=["elma","armut","mandalina"]

In [5]:
pd.Series(listfiyat)

0    30
1    45
2    20
dtype: int64

In [6]:
pd.Series(listfiyat,listisim)

elma         30
armut        45
mandalina    20
dtype: int64

In [7]:
pd.Series(data=listfiyat,index=listisim)

elma         30
armut        45
mandalina    20
dtype: int64

In [8]:
pd.Series(index=listisim,data= listfiyat)

elma         30
armut        45
mandalina    20
dtype: int64

In [9]:
npdizi=np.array([30,45,20])
pd.Series(npdizi,[1,2,3])

1    30
2    45
3    20
dtype: int32

In [10]:
pd.Series(["Busra","Betul","Cavusoglu"],[1,2,3])

1        Busra
2        Betul
3    Cavusoglu
dtype: object

In [11]:
isim=pd.Series(["Busra","Betul","Cavusoglu"],[1,2,3])
isim[2]

'Betul'

In [12]:
market1=pd.Series([10,15,40,60],["sut","yumurta","un","sebze"])
market2=pd.Series([9,17,50,20],["sut","yumurta","un","meyve"])

sum=market1+market2
sum

meyve       NaN
sebze       NaN
sut        19.0
un         90.0
yumurta    32.0
dtype: float64

In [13]:
data=np.random.randn(4,3)
data

array([[-0.1919194 ,  0.22195233,  0.47132573],
       [ 0.44242582, -0.27503516, -0.81178418],
       [-0.97061129, -1.12917731, -1.31376703],
       [-0.09972405, -1.50790855,  1.16119841]])

In [14]:
dataFrame=pd.DataFrame(data)
dataFrame

          0         1         2
0 -0.191919  0.221952  0.471326
1  0.442426 -0.275035 -0.811784
2 -0.970611 -1.129177 -1.313767
3 -0.099724 -1.507909  1.161198

In [15]:
type(dataFrame[1])

pandas.core.series.Series

In [26]:
newDataFrame=pd.DataFrame(data,index=["matematik","türkçe","sosyal","fen"],columns=["Betul","Elif","Busra"])
newDataFrame

              Betul      Elif     Busra
matematik -0.191919  0.221952  0.471326
türkçe     0.442426 -0.275035 -0.811784
sosyal    -0.970611 -1.129177 -1.313767
fen       -0.099724 -1.507909  1.161198

In [17]:
newDataFrame[["Elif","Busra"]]

               Elif     Busra
matematik  0.221952  0.471326
türkçe    -0.275035 -0.811784
sosyal    -1.129177 -1.313767
fen       -1.507909  1.161198

In [18]:
newDataFrame.iloc[0]

Betul   -0.191919
Elif     0.221952
Busra    0.471326
Name: matematik, dtype: float64

In [25]:
newDataFrame["Tuna"]=newDataFrame["Betul"]+newDataFrame["Betul"]
newDataFrame

              Betul      Elif     Busra      Tuna
matematik -0.191919  0.221952  0.471326 -0.383839
türkçe     0.442426 -0.275035 -0.811784  0.884852
sosyal    -0.970611 -1.129177 -1.313767 -1.941223
fen       -0.099724 -1.507909  1.161198 -0.199448

In [20]:
newDataFrame

              Betul      Elif     Busra      Tuna
matematik -0.191919  0.221952  0.471326 -0.383839
türkçe     0.442426 -0.275035 -0.811784  0.884852
sosyal    -0.970611 -1.129177 -1.313767 -1.941223
fen       -0.099724 -1.507909  1.161198 -0.199448

In [27]:
newDataFrame.drop("Elif", axis=1, inplace=True)
newDataFrame

              Betul     Busra
matematik -0.191919  0.471326
türkçe     0.442426 -0.811784
sosyal    -0.970611 -1.313767
fen       -0.099724  1.161198

In [30]:
newDataFrame.loc["matematik"]

Betul   -0.191919
Busra    0.471326
Name: matematik, dtype: float64

In [31]:
newDataFrame.loc["matematik"]["Betul"]

-0.19191939796409485

In [32]:
newDataFrame.loc["matematik","Betul"]

-0.19191939796409485

In [33]:
newDataFrame

              Betul     Busra
matematik -0.191919  0.471326
türkçe     0.442426 -0.811784
sosyal    -0.970611 -1.313767
fen       -0.099724  1.161198

In [34]:
newDataFrame<0

           Betul  Busra
matematik   True  False
türkçe     False   True
sosyal      True   True
fen         True  False

In [35]:
newDataFrame[newDataFrame<0]

              Betul     Busra
matematik -0.191919       NaN
türkçe          NaN -0.811784
sosyal    -0.970611 -1.313767
fen       -0.099724       NaN

In [43]:
newDataFrame[newDataFrame["Busra"]<0]

           Betul     Busra
türkçe  0.442426 -0.811784
sosyal -0.970611 -1.313767

In [56]:
veri=np.random.randn(4,3)
yeniDataFrame=pd.DataFrame(veri)
yeniDataFrame=pd.DataFrame(veri,index=["Ali","Ayse","Mert","Beyza"],columns=["Yas","Maas","Calısma saati"])
yeniDataFrame

            Yas      Maas  Calısma saati
Ali    0.699413 -0.603967      -0.340879
Ayse  -1.284635  0.838088      -0.771701
Mert  -0.827045 -0.621282       0.494429
Beyza  0.106779 -0.045678      -0.834398

In [55]:
yeniDataFrame.reset_index()

   index       Yas      Maas  Calısma saati
0    Ali  1.561912 -0.614486      -1.959523
1   Ayse -0.706663 -0.377181       0.077803
2   Mert -1.069966 -0.219074       0.164766
3  Beyza  0.739410  1.142502      -0.777615

In [57]:
yeniListe=["A","B","C","D"]
yeniDataFrame["yeni indeks"]=yeniListe
yeniDataFrame

            Yas      Maas  Calısma saati yeni indeks
Ali    0.699413 -0.603967      -0.340879           A
Ayse  -1.284635  0.838088      -0.771701           B
Mert  -0.827045 -0.621282       0.494429           C
Beyza  0.106779 -0.045678      -0.834398           D

In [58]:
yeniDataFrame.set_index("yeni indeks")

                  Yas      Maas  Calısma saati
yeni indeks
A            0.699413 -0.603967      -0.340879
B           -1.284635  0.838088      -0.771701
C           -0.827045 -0.621282       0.494429
D            0.106779 -0.045678      -0.834398